Revit 2026 API

# PreviewControlUIView Property

---

The UI view representing the preview view.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UIView UIView { get; }
```
```vb
Public ReadOnly Property UIView As UIView
	Get
```
```cpp
public:
property UIView^ UIView {
	UIView^ get ();
}
```
```fsharp
member UIView : UIView with get
```

#### Property Value

UIView

Use this handle to manipulate the zoom and pan of the view.

#### Reference

PreviewControl Class

Autodesk.Revit.UI Namespace